# 배열 합치기
a = [1,2,3]
b = [5,6,7]

########################################
# 원소 추가
a.append(4)

########################################
# 원소 삭제
# 방법 1
# a.remove(3)

# 방법2
# a.pop(1)

########################################
# 배열 확장

# 방법 1
# a.extend(b)
# print(a)

# 방법 2
# a += b
# print(a)

# 방법 3
# a = a*3
# print(a)

########################################
# 원하는 원소의 인덱스 찾기
# print(a.index(3))

########################################
# 배열 뒤집기
# a.reverse()
# print(a)

a.insert(3, 4)
print(a)

my_tuple = (3,4)
print(my_tuple.count(3))


